Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser
Represents the Tekla filter expression parser. Is used to parse the tekla filter files.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.TokenElementsCount
Represents the number of elements inside a object group.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.SectionHeader
Represents the Section Header in the filter file.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.FileHeader
Represents the filter file header.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.LeftParenthesisIndex
Represent the Left Parenthesis index in the section token.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.EnabledIndex
Represent the Enabled index in the section token.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.CategoryIndex
Represent the Category index in the section token.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.PropertyIndex
Represent the Property index in the section token.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.BinaryOperatorIndex
Represent the Binary Operator index in the section token.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.ValueIndex
Represent the Value index in the section token.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.RightParenthesisIndex
Represent the Right Parenthesis index in the section token.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.OperatorIndex
Represent the Operator index in the section token.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.NormalizeFilterExpression(System.String)
Normalizes the filter string in order to make it compatible with the Parser.
This is required in special scenario, for example when the filter expression
contains collection but doesn't have parenthesis.
FilterString: The filter file in string format.
Returns: Returns the filter file normalized.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.RemoveFilterHeaderAndFooter(System.String)
Removes the header and footer from the filter file. It also changes the carriage return to a space.
FilterString: The filter file in string format.
Returns: Returns the filter file body.
Throws Tekla.Structures.Filtering.FilterExpressionParserException: Throws a Tekla.Structures.Filtering.FilterExpressionParserException if no header is found.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.GetFirstParentesisIndexAndCount(System.String,System.Int32@)
Gets the index of the char representing the first open parenthesis and the number of parenthesis.
FilterString: The filter section string.
ParenthesisCount: The number of parenthesis.
Returns: The index of the char representing the first open parenthesis. If Parenthesis count == 0 returns -1.
Throws Tekla.Structures.Filtering.FilterExpressionParserException: Throws a Tekla.Structures.Filtering.FilterExpressionParserException if no section header is found.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.GetLastParentesisIndexAndCount(System.String,System.Int32@)
Gets the index of the char representing the last open parenthesis and the number of parenthesis.
FilterString: The filter section string.
ParenthesisCount: The number of parenthesis.
Returns: The index of the char representing the last open parenthesis.
Throws Tekla.Structures.Filtering.FilterExpressionParserException: Throws a Tekla.Structures.Filtering.FilterExpressionParserException if no section header is found.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.GetSectionTokenContent(System.String,System.Int32@,System.Int32@,System.Int32@,System.String@,System.String@,System.String@,System.String@,System.String@)
Gets the section token contents.
FilterString: The filter section string.
LeftParenthesis: The left parenthesis count.
RightParenthesis: The right parenthesis count.
Enabled: The enable field.
Category: The category field.
Property: The property field.
BinaryOperator: The binary operator field.
Value: The value field.
Operator: The operator field.
Throws Tekla.Structures.Filtering.FilterExpressionParserException: Throws an Tekla.Structures.Filtering.FilterExpressionParserException if the section contains invalid data.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.FindDataFilterExpression(System.String,System.String)
Searches in the ExecutingAssembly classes derived from Tekla.Structures.Filtering.DataFilterExpression. If found
checks if the Category and Property properties are equal to the one passed as parameter.
Category: The category to search.
Property: The property to search.
Returns: A new instance of the Tekla.Structures.Filtering.DataFilterExpression derived class.
Throws System.NotSupportedException: Throws System.NotSupportedException if no maching classes are found.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.UpdateParenthesis(System.String,System.Int32,System.Int32,System.Int32,System.Int32)
Updates the parenthesis count of a section.
FilterString: The filter section string.
FirstParenthesisIndex: The first parenthesis index.
FirstParenthesisCount: The first parenthesis count.
LastParenthesisIndex: The last parenthesis index.
LastParentesisCount: The last parenthesis count.
Returns: Returns a filter section string with updated first and last parenthesis.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.ParseString(System.String,System.IFormatProvider)
Parse a filter string and returns a new Tekla.Structures.Filtering.FilterExpression object.
FilterString: The filter string to parse.
Provider: An object that supports the System.IFormatProvider interface to parse correctly numbers and dates according to the current culture info.
Returns: A new Tekla.Structures.Filtering.FilterExpression object.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.Tokenizer(System.String)
Splits the current filter strings in multiple Tekla.Structures.TeklaStructuresInternal.Filtering.BinaryFilterExpressionToken.
Each token contains a single filter section or a collection of sub filters sections.
FilterString: The filter string to parse.
Returns: A list of Tekla.Structures.TeklaStructuresInternal.Filtering.BinaryFilterExpressionToken objects.
Throws Tekla.Structures.Filtering.FilterExpressionParserException: Throws an Tekla.Structures.Filtering.FilterExpressionParserException if the filter string contains errors.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.GetBinaryFilterExpressionElements(System.String)
Gets the binary filter expression as array of tree elements.
The first represents the left operand in the format "Category+Property", the second the Binary Operator, the third the Value.
BinaryFilterExpressionString: The input binary filter expression string.
Returns: Returns an array of tree elements containing the two binary filter expression operand and one operator.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.ParseLeftOperand(System.String)
Parses the left operand of the binary filter expression returning a new instance of the Tekla.Structures.Filtering.DataFilterExpression derived object.
BinaryFilterExpressionString: The binary filter expression string.
Returns: A new instance of the Tekla.Structures.Filtering.DataFilterExpression derived class representing the Left operand.
Throws Tekla.Structures.Filtering.FilterExpressionParserException: Throws an Tekla.Structures.Filtering.FilterExpressionParserException if the filter string contains errors.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.ParseStringOperatorType(System.String)
Parses a string operator type string and returns the correct StringOperatorType enum.
StringOperatorTypeString: The input string operator type string.
Returns: If found returns the correct StringOperatorType enum.
Throws System.NotSupportedException: Throws an System.NotSupportedException if the string operator type is not found.

Tekla.Structures.TeklaStructuresInternal.Filtering.Parsers.TeklaFilterExpressionParser.ParseNumericConstantFilterExpression(System.String,System.IFormatProvider)
Parses a string returning a new Tekla.Structures.Filtering.NumericConstantFilterExpression.
This override handles the special case of ObjectType.
NumericConstantString: The input string to parse.
Provider: An object that supports the System.IFormatProvider interface to parse correctly numbers and dates according to the current culture info.
Returns: A new Tekla.Structures.Filtering.NumericConstantFilterExpression.
Throws System.NotSupportedException: Throws an System.NotSupportedException exception if the input string is not supported.